test/dummy/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("category", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["category", "bbb"], ["created_at", Mon, 03 Feb 2014 16:59:09 UTC +00:00], ["name", "aaa"], ["updated_at", Mon, 03 Feb 2014 16:59:09 UTC +00:00]]